tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "altinity/clickhouse"
tap "dapr/tap"
tap "dbt-labs/dbt"
tap "h8r-dev/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-versions", "https://mirrors.ustc.edu.cn/homebrew-cask-versions.git"
tap "homebrew/core"
tap "homebrew/services"
tap "minio/stable"
tap "oven-sh/bun"
tap "turbot/tap"
tap "ubuntu/microk8s"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "glib"
brew "openssl@1.1"
brew "python@3.9"
brew "harfbuzz"
brew "openjdk"
brew "apache-spark"
brew "apr-util"
brew "blueutil"
brew "boost"
brew "python@3.11"
brew "boost-python3"
brew "gmp"
brew "gcc"
brew "gflags"
brew "glog"
brew "openblas"
brew "suite-sparse"
brew "tbb"
brew "ceres-solver"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "pango"
brew "snappy"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "hdf5"
brew "leveldb"
brew "lmdb"
brew "netcdf"
brew "numpy", link: false
brew "qt"
brew "vtk"
brew "opencv", link: false
brew "qt@5"
brew "pyqt@5"
brew "caffe"
brew "emacs"
brew "cask"
brew "chrome-cli"
brew "cmake"
brew "colordiff"
brew "libssh2"
brew "openldap"
brew "curl"
brew "etcd"
brew "exiftool"
brew "ffmpeg@4"
brew "freetds"
brew "fswatch"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git"
brew "git-flow"
brew "go"
brew "gobject-introspection"
brew "grafana"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "guile"
brew "helm"
brew "httpd"
brew "icdiff"
brew "iftop"
brew "libimobiledevice"
brew "ios-webkit-debug-proxy", args: ["HEAD"]
brew "jq"
brew "k3d"
brew "zookeeper"
brew "kafka"
brew "kompose"
brew "krb5"
brew "libfido2"
brew "libmagic"
brew "libpq"
brew "libxml2"
brew "libzip"
brew "luajit"
brew "lux"
brew "mas"
brew "mysql", restart_service: true
brew "mysql-client"
brew "nghttp2"
brew "nginx"
brew "node"
brew "nvm"
brew "pandoc"
brew "percona-toolkit"
brew "php"
brew "poppler"
brew "postgresql@14"
brew "tcl-tk"
brew "python-tk@3.9"
brew "python@3.10"
brew "python@3.8"
brew "redis"
brew "rust"
brew "rustup-init"
brew "spark"
brew "szip"
brew "telnet"
brew "veclibfort"
brew "viennacl"
brew "watch"
brew "watchman"
brew "wget"
brew "wmctrl"
brew "wrk"
brew "altinity/clickhouse/clickhouse@22.3"
brew "altinity/clickhouse/clickhouse@22.7", link: true
brew "dapr/tap/dapr-cli"
brew "h8r-dev/tap/heighliner"
brew "hashicorp/tap/vault"
brew "minio/stable/mc"
brew "minio/stable/minio"
brew "oven-sh/bun/bun"
brew "turbot/tap/steampipe"
brew "ubuntu/microk8s/microk8s"
cask "1password"
cask "1password-cli"
cask "adoptopenjdk12"
cask "adoptopenjdk8"
cask "basictex"
cask "bettertouchtool"
cask "beyond-compare"
cask "bleunlock"
cask "charles"
cask "chromedriver"
cask "gfxcardstatus"
cask "google-chrome"
cask "hammerspoon"
cask "istat-menus"
cask "masscode"
cask "motrix"
cask "multipass"
cask "navicat-for-sqlite"
cask "ngrok"
cask "qq"
cask "sequel-pro"
cask "sourcetree"
cask "teamviewer"
cask "the-unarchiver"
cask "v2rayu"
cask "vagrant"
cask "vmware-fusion"
cask "wireshark"
mas "Bitwarden", id: 1352778147
mas "Bluetooth Inspector", id: 1509085044
mas "Disk Speed Test", id: 425264550
mas "LightBlue", id: 557428110
mas "LINE", id: 539883307
mas "MarginNote 3", id: 1423522373
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Notability", id: 360593530
mas "Notability", id: 736189492
mas "Paste", id: 967805235
mas "Playgrounds", id: 1496833156
mas "Sequel Ace", id: 1518036000
mas "Spark", id: 1176895641
mas "Todoist", id: 585829637
mas "Voice.ai", id: 6444030605
mas "Xcode", id: 497799835
mas "Xmind", id: 1327661892
mas "Xnip", id: 1221250572
mas "微信", id: 836500024
mas "钉钉", id: 1435447041
vscode "42Crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alefragnani.project-manager"
vscode "batisteo.vscode-django"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "cipchk.zh-hans-tt-hant-vscode"
vscode "CodeInChinese.EnglishChineseDictionary"
vscode "CodeStream.codestream"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "cweijan.vscode-database-client2"
vscode "daohaodesign.blender-python-addontool-cn-byten"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "ExecutableBookProject.myst-highlight"
vscode "fabiospampinato.vscode-diff"
vscode "felixfbecker.php-intellisense"
vscode "formulahendry.code-runner"
vscode "fwcd.kotlin"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.remotehub"
vscode "GitLab.gitlab-workflow"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "HookyQR.minify"
vscode "ipedrazas.kubernetes-snippets"
vscode "iterative.dvc"
vscode "JacquesLucke.blender-development"
vscode "jameswain.gitlab-pipelines"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "KevinRose.vsc-python-indent"
vscode "leechaojiang.px-to-vw"
vscode "LeetCode.vscode-leetcode"
vscode "lunuan.kubernetes-templates"
vscode "mathiasfrohlich.Kotlin"
vscode "mblode.pretty-formatter"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-sqlite"
vscode "NecatiARSLAN.aws-s3-vscode-extension"
vscode "njpwerner.autodocstring"
vscode "nocalhost.nocalhost"
vscode "octref.vetur"
vscode "oliversturm.fix-json"
vscode "qwtel.sqlite-viewer"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "ShahilKumar.docxreader"
vscode "SonarSource.sonarlint-vscode"
vscode "tamasfe.even-better-toml"
vscode "thomascsd.vscode-readme-pattern"
vscode "twxs.cmake"
vscode "uctakeoff.vscode-counter"
vscode "vector-of-bool.gitflow"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-concourse"
vscode "vmware.vscode-manifest-yaml"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "weijunyu.vscode-json-path"
vscode "WhenSunset.chatgpt-china"
vscode "wholroyd.jinja"
vscode "wingrunr21.vscode-ruby"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
vscode "zobo.php-intellisense"
