# tap brew source
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "heroku/brew"

# tools
brew "zsh"
brew "bash-completion"
brew "awk"
brew "gcc"
brew "git-flow"
brew "graphicsmagick"
brew "httpie"
brew "jq"
brew "pidof"
brew "telnet"
brew "wget"

# language
brew "python"
brew "python@2"
brew "go"
brew "node"
brew "luajit"
brew "php", restart_service: true
brew "phplint"
brew "composer"

# devlope service
# ELK 套件
cask "java8"
brew "elasticsearch", restart_service: true
brew "kibana", restart_service: true
brew "logstash", restart_service: true
brew "metricbeat"
brew "filebeat" 

brew "mysql", restart_service: true
brew "nginx", restart_service: true
brew "redis", restart_service: true

brew "heroku" # vps
brew "hugo" # golang 博客工具


# software
cask "beyond-compare" # 文本比较工具，git合并
cask "charles" # http抓包
cask "google-drive-file-stream" # google 云盘
cask "istat-menus" # macos 指标监控
cask "navicat-for-sqlite" # sqlite client
cask "sequel-pro" # mysql client
cask "sourcetree" # git client
cask "teamviewer" # 远程协助
cask "the-unarchiver" # 解压缩
cask "wireshark" # tcp抓包

mas "1Password", id: 1333542190 # 密码管理
mas "企业微信", id: 1189898970
mas "微信", id: 836500024
mas "XMind:Zen", id: 1327661892
